backend/data/simulations/quittee/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
inlet
{
    type            fixedValue;
    value           uniform 1e-5;
}

outlet
{
    type            zeroGradient;
}

wall
{
    type            symmetry;
}

symmetry
{
    type            symmetry;
}

tube
{
    type            epsilonWallFunction;
    value           uniform 1e-5;
}

}


// ************************************************************************* //
