backend/data/simulations/quittee/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8e-6;

boundaryField
{
inlet
{
    type            fixedValue;
    value           uniform 8e-6;
}

outlet
{
    type            zeroGradient;
}

wall
{
    type            symmetry;
}

symmetry
{
    type            symmetry;
}

tube
{
    type            kqRWallFunction;
    value           uniform 8e-6;  // requis
}
}



// ************************************************************************* //
