backend/data/simulations/quittee/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.12;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            symmetry;
    }

    symmetry
    {
        type            symmetry;
    }

    tube
    {
        type            omegaWallFunction;
        value           uniform 0.12;  // requis même si pas utilisé
    }
}



// ************************************************************************* //
